Revit 2027 API
Floor.SpanDirectionAngle Property
 Retrieve the span direction angle of the floor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SpanDirectionAngle { get; set; }
Public Property SpanDirectionAngle As Double
	Get
	Set
public:
property double SpanDirectionAngle {
	double get ();
	void set (double value);
}
member SpanDirectionAngle : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property:
Remarks
 The angle returned is in radians. An exception will be thrown if the floor is non structural.
See Also
Reference
Floor Class
Autodesk.Revit.DB Namespace